
"""
Реалізуйте алгоритм сортування вибором.
"""

N = 5000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for i in range(n - 1,0,-1):
        pos = 0
        for j in range(1,i+1):
            if array[pos] > array[j]:
                pos = j
        array[pos],array[i] = array[i],array[pos]
        # print(array)

if __name__ == "__main__":
    arr = [9, 1, -1, 20, 19, 10, -5, 13, 7]
    # arr = sorted(arr)
    print(arr)
    sort(arr)
