
"""
Модифікуйте алгоритм бульбашкового сортування,
перевіркою на кожному проході чи відсортований вже масив.
Порівняйте час виконання обох програм.
"""

N = 5000     # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for pass_num in range(n - 1, 0, -1):
        is_sorted = True
        for j in range(pass_num):
            if array[j] > array[j + 1]:
                array[j], array[j + 1] = array[j + 1], array[j]
                is_sorted = False
        if is_sorted:
            return
        # print(array)


if __name__ == "__main__":
    arr = [9, 1, -1, 20, 19, 10, -5, 13, 7]
    # arr = sorted(arr)
    print(arr)
    sort(arr)
